app/Controllers/Mitsuba.php

    public function data()
    {
        $model = new MitsubaLabelModel();
        $rows  = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `mitsuba_labels`
ORDER BY `created_at` DESC

    public function batchPrint()
    {
        $request = $this->request;
        $ids     = $request->getPost('ids');

        if (empty($ids) || !is_array($ids)) {
            return $this->response->setJSON(['success' => false, 'message' => 'Tidak ada data yang dipilih.']);
        }

        $model = new MitsubaLabelModel();
        $rows  = $model->whereIn('id', $ids)->orderBy('id', 'ASC')->findAll();

        if (empty($rows)) {
            return $this->response->setJSON(['success' => false, 'message' => 'Data tidak ditemukan.']);
        }

        $sessionKey = 'mitsuba_batch_' . uniqid();
        session()->set($sessionKey, [
            'rows' => $rows,
        ]);

        $model->whereIn('id', $ids)->set(['is_printed' => 1])->update();
---
SELECT *
FROM `mitsuba_labels`
WHERE `id` IN ('1')
ORDER BY `id` ASC
UPDATE `mitsuba_labels` SET `is_printed` = 1
WHERE `id` IN ('1')